# Task 1:

# print("Введите цифру, обозначающую день недели (от 1 до 7): ")
# a = int(input())
# if (a >= 1 and a <= 5): 
#     print("рабочий день ")
# else: 
#    print("выходной день ")

# Task 2:

# print("Введите значение точки X и Y (в диапазоне от -50 до 50): ")
# x = int(input("X = "))
# y = int(input("Y = "))
# if (x > 0 and y > 0): print ("первая четверть")
# if (x < 0 and y < 0): print ("третья четверть")
# if (x > 0 and y < 0): print ("четвертая четверть")
# if (x < 0 and y > 0): print ("вторая четверть")
# if (x == 0 and y != 0): print ("точка находится на оси Y")
# if (x != 0 and y == 0): print ("точка находится на оси X")
# if (x == 0 and y == 0): print ("точка является центром координат")

# Task 3:

# print("Введите номер четверти (от 1 до 4): ")
# num = int(input())
# if (num == 1): print ("Точки X и Y могут находиться в x > 0 и y > 0 диапазоне")
# if (num == 2): print ("Точки X и Y могут находиться в x < 0 и y > 0 диапазоне")
# if (num == 3): print ("Точки X и Y могут находиться в x < 0 и y < 0 диапазоне")
# if (num == 4): print ("Точки X и Y могут находиться в x > 0 и y < 0 диапазоне")

# Task 4:

# print("Введите значение точки A по оси X и Y")
# xA = float(input("X = "))
# yA = float(input("Y = "))
# print("Введите значение точки B по оси X и Y")
# xB = float(input("X = "))
# yB = float(input("Y = "))

# import math
# result = math.sqrt(((xA-xB)**2 + (yA-yB)**2))
# print('{:.3f}'.format(result)) 
# # Если оставлять 2 знака после запятой, то округляет к следующему числу. Пока не нашел другого варианта

